# 补全缺失值

fillna()

In [1]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [17]:
df

          0         1         2
0  0.018213       NaN       NaN
1  1.222618       NaN       NaN
2  0.534488       NaN -0.665389
3  2.035954       NaN  0.465500
4  0.582223 -0.806855  0.935657
5  0.873322  1.495501  1.857817
6  0.821489 -2.172816 -1.813882

In [11]:
df.fillna(0)

          0         1         2
0 -0.168058  0.000000  0.000000
1 -0.341284  0.000000  0.000000
2 -0.899078  0.000000  0.394510
3  0.106119  0.000000  1.090535
4 -0.015345 -0.733915  0.221524
5  0.004739  1.648898  0.213412
6  0.155194  0.686521  0.502558

In [12]:
df.fillna({1:0.5, 2:0})

          0         1         2
0 -0.168058  0.500000  0.000000
1 -0.341284  0.500000  0.000000
2 -0.899078  0.500000  0.394510
3  0.106119  0.500000  1.090535
4 -0.015345 -0.733915  0.221524
5  0.004739  1.648898  0.213412
6  0.155194  0.686521  0.502558

In [18]:
df.fillna(0, inplace=True)

In [19]:
df

          0         1         2
0  0.018213  0.000000  0.000000
1  1.222618  0.000000  0.000000
2  0.534488  0.000000 -0.665389
3  2.035954  0.000000  0.465500
4  0.582223 -0.806855  0.935657
5  0.873322  1.495501  1.857817
6  0.821489 -2.172816 -1.813882

In [20]:
df2 = pd.DataFrame(np.random.randn(6, 3))

In [21]:
df2.iloc[2:, 1] = NA
df2.iloc[4:, 2] = NA

In [22]:
df2

          0         1         2
0  1.553218  1.670821  1.635905
1 -0.304334  0.501413  0.864260
2 -0.270790       NaN -1.092270
3 -0.082854       NaN -0.274665
4  0.920061       NaN       NaN
5 -0.245797       NaN       NaN

In [23]:
df2.fillna(method='ffill')

          0         1         2
0  1.553218  1.670821  1.635905
1 -0.304334  0.501413  0.864260
2 -0.270790  0.501413 -1.092270
3 -0.082854  0.501413 -0.274665
4  0.920061  0.501413 -0.274665
5 -0.245797  0.501413 -0.274665

In [24]:
df2.fillna(method='ffill', limit=2)

          0         1         2
0  1.553218  1.670821  1.635905
1 -0.304334  0.501413  0.864260
2 -0.270790  0.501413 -1.092270
3 -0.082854  0.501413 -0.274665
4  0.920061       NaN -0.274665
5 -0.245797       NaN -0.274665

## 用平均值 和 中位数填充

In [25]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [26]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [27]:
data.fillna(data.median())

0    1.0
1    3.5
2    3.5
3    3.5
4    7.0
dtype: float64